tsukurobo/tsukurobo_drivers/ise_motor_driver/arduino_writing_machine/hardware/ATmega88_168P_328P/avr/boards.txt
menu.clock=Clock

atmega88.name=ATmega88
atmega88.upload.tool=arduino:avrdude
atmega88.upload.protocol=arduino
atmega88.upload.maximum_size=7680
atmega88.upload.maximum_data_size=1024
atmega88.bootloader.tool=arduino:avrdude
atmega88.bootloader.unlock_bits=0x3F
atmega88.bootloader.lock_bits=0x0F
atmega88.build.mcu=atmega88
atmega88.build.core=arduino:arduino

atmega88.menu.clock.Xtal8MHz=8MHz/X'tal
atmega88.menu.clock.Xtal8MHz.upload.speed=57600
atmega88.menu.clock.Xtal8MHz.bootloader.low_fuses=0xff
atmega88.menu.clock.Xtal8MHz.bootloader.high_fuses=0xdd
atmega88.menu.clock.Xtal8MHz.bootloader.extended_fuses=0x04
atmega88.menu.clock.Xtal8MHz.bootloader.file=optiboot/optiboot_atmega88_8MHz.hex
atmega88.menu.clock.Xtal8MHz.build.f_cpu=8000000L
atmega88.menu.clock.Xtal8MHz.build.variant=arduino:standard

atmega88.menu.clock.Int8MHz=8MHz/INT OSC
atmega88.menu.clock.Int8MHz.upload.speed=57600
atmega88.menu.clock.Int8MHz.bootloader.low_fuses=0xe2
atmega88.menu.clock.Int8MHz.bootloader.high_fuses=0xde
atmega88.menu.clock.Int8MHz.bootloader.extended_fuses=0x04
atmega88.menu.clock.Int8MHz.bootloader.file=optiboot/optiboot_atmega88_8MHz.hex
atmega88.menu.clock.Int8MHz.build.f_cpu=8000000L
atmega88.menu.clock.Int8MHz.build.variant=IntOsc

atmega88.menu.clock.Xtal16MHz=16MHz/X'tal
atmega88.menu.clock.Xtal16MHz.upload.speed=115200
atmega88.menu.clock.Xtal16MHz.bootloader.low_fuses=0xff
atmega88.menu.clock.Xtal16MHz.bootloader.high_fuses=0xdd
atmega88.menu.clock.Xtal16MHz.bootloader.extended_fuses=0x04
atmega88.menu.clock.Xtal16MHz.bootloader.file=optiboot/optiboot_atmega88.hex
atmega88.menu.clock.Xtal16MHz.build.f_cpu=16000000L
atmega88.menu.clock.Xtal16MHz.build.variant=arduino:standard

atmega168p.name=ATmega168P
atmega168p.upload.tool=arduino:avrdude
atmega168p.upload.protocol=arduino
atmega168p.upload.maximum_size=15872
atmega168p.upload.maximum_data_size=1024
atmega168p.bootloader.tool=arduino:avrdude
atmega168p.bootloader.unlock_bits=0x3F
atmega168p.bootloader.lock_bits=0x0F
atmega168p.build.mcu=atmega168p
atmega168p.build.core=arduino:arduino

atmega168p.menu.clock.Xtal8MHz=8MHz/X'tal
atmega168p.menu.clock.Xtal8MHz.upload.speed=57600
atmega168p.menu.clock.Xtal8MHz.bootloader.low_fuses=0xff
atmega168p.menu.clock.Xtal8MHz.bootloader.high_fuses=0xdd
atmega168p.menu.clock.Xtal8MHz.bootloader.extended_fuses=0x04
atmega168p.menu.clock.Xtal8MHz.bootloader.file=optiboot/optiboot_atmega168p_8MHz.hex
atmega168p.menu.clock.Xtal8MHz.build.f_cpu=8000000L
atmega168p.menu.clock.Xtal8MHz.build.variant=arduino:standard

atmega168p.menu.clock.Int8MHz=8MHz/INT OSC
atmega168p.menu.clock.Int8MHz.upload.speed=57600
atmega168p.menu.clock.Int8MHz.bootloader.low_fuses=0xe2
atmega168p.menu.clock.Int8MHz.bootloader.high_fuses=0xde
atmega168p.menu.clock.Int8MHz.bootloader.extended_fuses=0x04
atmega168p.menu.clock.Int8MHz.bootloader.file=optiboot/optiboot_atmega168p_8MHz.hex
atmega168p.menu.clock.Int8MHz.build.f_cpu=8000000L
atmega168p.menu.clock.Int8MHz.build.variant=IntOsc

atmega168p.menu.clock.Xtal16MHz=16MHz/X'tal
atmega168p.menu.clock.Xtal16MHz.upload.speed=115200
atmega168p.menu.clock.Xtal16MHz.bootloader.low_fuses=0xff
atmega168p.menu.clock.Xtal16MHz.bootloader.high_fuses=0xdd
atmega168p.menu.clock.Xtal16MHz.bootloader.extended_fuses=0x04
atmega168p.menu.clock.Xtal16MHz.bootloader.file=optiboot/optiboot_atmega168p.hex
atmega168p.menu.clock.Xtal16MHz.build.f_cpu=16000000L
atmega168p.menu.clock.Xtal16MHz.build.variant=arduino:standard

atmega328p.name=ATmega328P
atmega328p.upload.tool=arduino:avrdude
atmega328p.upload.protocol=arduino
atmega328p.upload.maximum_size=32256
atmega328p.upload.maximum_data_size=2048
atmega328p.bootloader.tool=arduino:avrdude
atmega328p.bootloader.unlock_bits=0x3F
atmega328p.bootloader.lock_bits=0x0F
atmega328p.build.mcu=atmega328p
atmega328p.build.core=arduino:arduino

atmega328p.menu.clock.Xtal8MHz=8MHz/X'tal
atmega328p.menu.clock.Xtal8MHz.upload.speed=57600
atmega328p.menu.clock.Xtal8MHz.bootloader.low_fuses=0xff
atmega328p.menu.clock.Xtal8MHz.bootloader.high_fuses=0xde
atmega328p.menu.clock.Xtal8MHz.bootloader.extended_fuses=0x05
atmega328p.menu.clock.Xtal8MHz.bootloader.file=optiboot/optiboot_atmega328_8MHz.hex
atmega328p.menu.clock.Xtal8MHz.build.f_cpu=8000000L
atmega328p.menu.clock.Xtal8MHz.build.variant=arduino:standard

atmega328p.menu.clock.Int8MHzint=8MHz/INT OSC
atmega328p.menu.clock.Int8MHzint.upload.speed=57600
atmega328p.menu.clock.Int8MHzint.bootloader.low_fuses=0xe2
atmega328p.menu.clock.Int8MHzint.bootloader.high_fuses=0xde
atmega328p.menu.clock.Int8MHzint.bootloader.extended_fuses=0x06
atmega328p.menu.clock.Int8MHzint.bootloader.file=optiboot/optiboot_atmega328_8MHz.hex
atmega328p.menu.clock.Int8MHzint.build.f_cpu=8000000L
atmega328p.menu.clock.Int8MHzint.build.variant=IntOsc

atmega328p.menu.clock.Xtal16MHz=16MHz/X'tal
atmega328p.menu.clock.Xtal16MHz.upload.speed=115200
atmega328p.menu.clock.Xtal16MHz.bootloader.low_fuses=0xff
atmega328p.menu.clock.Xtal16MHz.bootloader.high_fuses=0xde
atmega328p.menu.clock.Xtal16MHz.bootloader.extended_fuses=0x05
atmega328p.menu.clock.Xtal16MHz.bootloader.file=optiboot/optiboot_atmega328.hex
atmega328p.menu.clock.Xtal16MHz.build.f_cpu=16000000L
atmega328p.menu.clock.Xtal16MHz.build.variant=arduino:standard

atmega328p.menu.clock.Xtal20MHz=20MHz/X'tal
atmega328p.menu.clock.Xtal20MHz.upload.speed=144000
atmega328p.menu.clock.Xtal20MHz.bootloader.low_fuses=0xff
atmega328p.menu.clock.Xtal20MHz.bootloader.high_fuses=0xde
atmega328p.menu.clock.Xtal20MHz.bootloader.extended_fuses=0x05
atmega328p.menu.clock.Xtal20MHz.bootloader.file=optiboot/optiboot_atmega328_20MHz.hex
atmega328p.menu.clock.Xtal20MHz.build.f_cpu=20000000L
atmega328p.menu.clock.Xtal20MHz.build.variant=arduino:standard
